# Exercise
In exercise folder (same level as this notebook on github) there is hiring.csv. This file contains hiring statics for a firm such as experience of candidate, his written test score and personal interview score. Based on these 3 factors, HR will decide the salary. Given this data, you need to build a machine learning model for HR department that can help them decide salaries for future candidates. Using this predict salaries for following candidates,

## 2 yr experience, 9 test score, 6 interview score

## 12 yr experience, 10 test score, 10 interview score

Answer
53713.86 and 93747.79

In [1]:
import pandas as pd
import numpy as np
#import matplotlib.pyplot as plt
from sklearn import linear_model
from word2number import w2n

### y = m1*x1 + m2*x2 + m3*x3 + b

In [2]:
df = pd.read_csv("hiring.csv")
df

  experience  test_score (out of 10)  interview_score (out of 10)  salary ($)
0        NaN                     8.0                            9       50000
1        NaN                     8.0                            6       45000
2       five                     6.0                            7       60000
3        two                    10.0                           10       65000
4      seven                     9.0                            6       70000
5      three                     7.0                           10       62000
6        ten                     NaN                            7       72000
7     eleven                     7.0                            8       80000

In [3]:
df.experience = df.experience.fillna("zero")
df

  experience  test_score (out of 10)  interview_score (out of 10)  salary ($)
0       zero                     8.0                            9       50000
1       zero                     8.0                            6       45000
2       five                     6.0                            7       60000
3        two                    10.0                           10       65000
4      seven                     9.0                            6       70000
5      three                     7.0                           10       62000
6        ten                     NaN                            7       72000
7     eleven                     7.0                            8       80000

In [4]:
#df['test_score (out of 10)'] = df['test_score (out of 10)'].fillna(df['test_score (out of 10)'].median())
#df

In [5]:
df.experience = df.experience.apply(w2n.word_to_num)
df

   experience  test_score (out of 10)  interview_score (out of 10)  salary ($)
0           0                     8.0                            9       50000
1           0                     8.0                            6       45000
2           5                     6.0                            7       60000
3           2                    10.0                           10       65000
4           7                     9.0                            6       70000
5           3                     7.0                           10       62000
6          10                     NaN                            7       72000
7          11                     7.0                            8       80000

In [6]:
import math
mean_test_score = math.floor(df['test_score (out of 10)'].mean())
#mean_test_score
df['test_score (out of 10)'] = df['test_score (out of 10)'].fillna(mean_test_score)
df

   experience  test_score (out of 10)  interview_score (out of 10)  salary ($)
0           0                     8.0                            9       50000
1           0                     8.0                            6       45000
2           5                     6.0                            7       60000
3           2                    10.0                           10       65000
4           7                     9.0                            6       70000
5           3                     7.0                           10       62000
6          10                     7.0                            7       72000
7          11                     7.0                            8       80000

In [7]:
reg_model = linear_model.LinearRegression()
# with inclusion of independent variable and depnedent variable
#reg_model.fit(df[['experience','test_score (out of 10)','interview_score (out of 10)']],df['salary ($)'])

# with exclusion of depnedent variable
reg_model.fit(df.drop('salary ($)',axis='columns'),df['salary ($)'])

LinearRegression()

## salary = (m1 x experience) + (m2 x test_score) + (m3 x interview_score) + intercept
### here <b>m1, m2, m3</b> are coefficients

In [8]:
reg_model.predict([[2,9,6]])

C:\Users\39762\AppData\Local\Programs\Python\Python310\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([53713.86677124])

In [9]:
reg_model.coef_

array([2922.26901502, 2221.30909959, 2147.48256637])

In [10]:
reg_model.intercept_

14992.65144669314

In [12]:
(2922.26901502 * 12) + (2221.30909959 * 10) + (10 * 2147.48256637)

78755.14483984001